In [1]:
%pip install pandas

Requirement already satisfied: pandas in /Users/ssharma/Desktop/python_tutorial/data_science/.venv/lib/python3.9/site-packages (2.3.3)
Requirement already satisfied: tzdata>=2022.7 in /Users/ssharma/Desktop/python_tutorial/data_science/.venv/lib/python3.9/site-packages (from pandas) (2025.2)
Requirement already satisfied: python-dateutil>=2.8.2 in /Users/ssharma/Desktop/python_tutorial/data_science/.venv/lib/python3.9/site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in /Users/ssharma/Desktop/python_tutorial/data_science/.venv/lib/python3.9/site-packages (from pandas) (2025.2)
Requirement already satisfied: numpy>=1.22.4 in /Users/ssharma/Desktop/python_tutorial/data_science/.venv/lib/python3.9/site-packages (from pandas) (2.0.2)
Requirement already satisfied: six>=1.5 in /Users/ssharma/Desktop/python_tutorial/data_science/.venv/lib/python3.9/site-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)
WARNING: You are using pip version 21.2.4; however, version 25.3 is available.
You should consider upgrading via the '/Users/ssharma/Desktop/python_tutorial/data_science/.venv/bin/python -m pip install --upgrade pip' command.
Note: you may need to restart the kernel to use updated packages.

In [2]:
import pandas as pd

In [ ]:
# Dataframe -> Pandas Class which holds the CSV file into a tabular format

In [3]:
df = pd.read_csv("data.csv")

In [8]:
# Display the first 5 rows of the data
df.head(10) # optional parameter, default -> 5

   s.n    name  grade    address  gender
0    1  Sharad     10  Kathmandu    Male
1    2    John     11  Minnesota    Male
2    3   Alice     11     Kansas  Female
3    4  Shilpa     10      Delhi  Female
4    5    Ajay      9     Mumbai    Male

In [9]:
type(df)

pandas.core.frame.DataFrame

In [13]:
df['name']
df.name

0    Sharad
1      John
2     Alice
3    Shilpa
4      Ajay
Name: name, dtype: object

In [14]:
df['grade']
df.grade

0    10
1    11
2    11
3    10
4     9
Name: grade, dtype: int64

In [17]:
# Selecting Multiple Columns
df[['name', 'grade']]

     name  grade
0  Sharad     10
1    John     11
2   Alice     11
3  Shilpa     10
4    Ajay      9

In [18]:
display(df['name'])
display(df[['name']])

0    Sharad
1      John
2     Alice
3    Shilpa
4      Ajay
Name: name, dtype: object

     name
0  Sharad
1    John
2   Alice
3  Shilpa
4    Ajay

In [22]:
# Selecting a cell in dataframe
df.loc[0, ['name', 'grade']]

name     Sharad
grade        10
Name: 0, dtype: object

In [26]:
# Selecting a cell based on index on both row and column
df.iloc[0, 1]

# Multiple Columns
df.iloc[0, [1, 2]]

name     Sharad
grade        10
Name: 0, dtype: object

In [27]:
# Slicing
df.iloc[[0,1], [0,1]]

   s.n    name
0    1  Sharad
1    2    John

In [29]:
df.loc[[2,3], ['gender', 'name']]

   gender    name
2  Female   Alice
3  Female  Shilpa

In [30]:
df['gender']

0      Male
1      Male
2    Female
3    Female
4      Male
Name: gender, dtype: object

In [31]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 5 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   s.n      5 non-null      int64
 1   name     5 non-null      object
 2   grade    5 non-null      int64
 3   address  5 non-null      object
 4   gender   5 non-null      object
dtypes: int64(2), object(3)
memory usage: 328.0+ bytes